#define _CRT_SECURE_NO_WARNINGS 1

//#include <stdio.h>
//
//int main()
//{
//	int num = 9;
//	float* pFloat = (float*)&num;
//	printf("n：%d\n", num);
//	printf("*pFloat：%f\n", *pFloat);
//	*pFloat = 9.0;
//	printf("num：%d\n", num);
//	printf("*pFloat：%f\n", *pFloat);
//
//	return 0;
//}


//#include <stdio.h>
//
//int main()
//{
//	float x = 5.5;
//	//二进制是 101.1
//	//1.011 * 2^2
//	//V = (-1)^0 * 1.011 * 2^2
//	//其中S=0, M=1.011, E=2
//	//E+127=129
//	//129的二进制是 1000 0001
//	// 0 10000001 01100000000000000000000
//	// S    E           M
//	//四位二进制是一位十六进制
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	// 4    0    b    0    0    0    0    0 
//	//40 b0 00 00
//	return 0;
//}

//下面，让我们回到一开始的问题
#include <stdio.h>

int main()
{
	int num = 9;
	//0000 0000 0000 0000 0000 0000 0000 1001
	float* pFloat = (float*)&num;
	printf("n：%d\n", num);
	//9
	printf("*pFloat：%f\n", *pFloat);
	//0 00000000 00000000000000000001001
	//S E(全0，-126)           M
	//(-1)^0 * 0.00000000000000000001001 * 2^(-126)
	//%f保留六位，保留不到有效位
	//0.000000

	*pFloat = 9.0;
	//1001.0
	//1.001 * 2^3
	//(-1)^0 * 1.001 * 2^3
	//S=-1 E=3 M=1.001
	//E+127=130 二进制为1000 0010
	//0 10000010 00100000000000000000000
	printf("num：%d\n", num);
	//符号位是0，正数，原码补码相同
	//0 10000010 00100000000000000000000的十进制1091567616
	printf("*pFloat：%f\n", *pFloat);
	//浮点数存浮点数拿，9.000000

	return 0;
}

